src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоПриобретения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Местоположение</name>
    <type>
      <types>EnumRef.Местоположения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Сайт</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПриблизительно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРазмещения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыделитьЦветом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомпьютернаяСборкаЕстьСвободные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомпьютернаяСборкаКомпонент</name>
    <comment>это компонент компьютерной сборки</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>QR_Code</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтикеткаРаспечатана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОстаткиПоРазмещению/ОстаткиПоРазмещению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОстаткиПоРазмещению</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПриблизительно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Размещение</name>
    <type>
      <types>CatalogRef.Размещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Размещения/Размещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Размещения</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыделитьЦветом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомпьютернаяСборка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/НоменклатураПрисоединенныеФайлы/НоменклатураПрисоединенныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НоменклатураПрисоединенныеФайлы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Автор</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаема</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификацииУниверсальная</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата добавления файла в базу</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Зашифрован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <comment>Индекс иконки, соответствующей расширению файла, для показа в списке</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Описание файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <comment>Дополнительный путь к файлу на диске (в случае если ТипХраненияФайла - на диске)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <comment>Размер файла</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Редактирует</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИзвлеченияТекста</name>
    <type>
      <types>EnumRef.СтатусыИзвлеченияТекстаФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <comment>Текст, извлеченный из файла - для полнотекстового поиска</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипХраненияФайла</name>
    <comment>Где хранятся файлы - в базе как ХранилищеЗначения или в каталоге на диске</comment>
    <type>
      <types>EnumRef.ТипыХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Том</name>
    <comment>Ссылка на том (в случае если ТипХраненияФайла - на диске)</comment>
    <type>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлХранилище</name>
    <comment>Служебное поле для обмена файлами в РИБ</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьВерсии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьЭлектронныеПодписи</name>
    <attributes>
      <name>ДатаПодписи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайлаПодписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>260</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КомуВыданСертификат</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отпечаток</name>
      <comment>Отпечаток сертификата</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>УстановившийПодпись</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <comment>Двоичные данные сертификата</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроверкиПодписи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодписьВерна</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьСертификатыШифрования</name>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <comment>Двоичные данные сертификата</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Номенклатура/Forms/ПоРазмещению/Module.bsl
#Область СобытияФормы

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ТекущийУзел	= Параметры.ТекущийУзел;
	
	ЗаполнитьДеревоТовары();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	НастроитьФормуПриОткрытии();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()

	НастроитьФормуПриОткрытии();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "Запись_Номенклатура" Тогда

		Если Параметр.Свойство("Ключ") 
			И ЗначениеЗаполнено(Параметр.Ключ) Тогда

			МассивУзлов = НоменклатураСервер.ПолучитьРазмещения(Параметр.Ключ);
			
			Если МассивУзлов.Количество() > 0 Тогда

				ЦелевойУзел = МассивУзлов[0];

				УстановитьИсториюУзлов(ЦелевойУзел);
			
				ЗаполнитьДеревоТовары();
				КоллекцияЭлементовДерева = Товары.ПолучитьЭлементы();	
				ИДСтроки = ОбойтиУровеньДерева(КоллекцияЭлементовДерева, ТекущийУзел);
				Если ИДСтроки <> Неопределено Тогда
					Элементы.Товары.Развернуть(ИДСтроки);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "Запись_ЭлементаРазмещения" Тогда
	
		Если Параметр.Свойство("Ключ") 
			И ЗначениеЗаполнено(Параметр.Ключ) Тогда
			
			НоменклатураКлиент.УстановитьВидимостьКорзины(Элементы);

			//ТекущийУзел = Параметр.Ключ;
			УстановитьИсториюУзлов(Параметр.Ключ);
			
			ЗаполнитьДеревоТовары();

			КоллекцияЭлементовДерева = Товары.ПолучитьЭлементы();	

			ИДСтроки = ОбойтиУровеньДерева(КоллекцияЭлементовДерева, ТекущийУзел);

			Если ИДСтроки <> Неопределено Тогда
				Элементы.Товары.Развернуть(ИДСтроки);
			КонецЕсли;
		КонецЕсли;

	ИначеЕсли ИмяСобытия = "Запись_ГруппыРазмещения" Тогда
	
		Если Параметр.Свойство("Ключ") 
			И ЗначениеЗаполнено(Параметр.Ключ) Тогда
			
			НоменклатураКлиент.УстановитьВидимостьКорзины(Элементы);

			//ТекущийУзел = Параметр.Ключ;
			УстановитьИсториюУзлов(Параметр.Ключ);
			
			ЗаполнитьДеревоТовары();

			КоллекцияЭлементовДерева = Товары.ПолучитьЭлементы();	

			ИДСтроки = ОбойтиУровеньДерева(КоллекцияЭлементовДерева, ТекущийУзел);

			Если ИДСтроки <> Неопределено Тогда
				Элементы.Товары.Развернуть(ИДСтроки);
			КонецЕсли;
		КонецЕсли;
	
	ИначеЕсли ИмяСобытия = "ПомещениеВКорзину" Тогда
	
		НоменклатураКлиент.УстановитьВидимостьКорзины(Элементы);
		
		//ТекущийУзел = НоменклатураСервер.ПолучитьУзелКорзины_Элемент();
		УстановитьИсториюУзлов(НоменклатураСервер.ПолучитьУзелКорзины_Элемент());
		
		ЗаполнитьДеревоТовары();

		КоллекцияЭлементовДерева = Товары.ПолучитьЭлементы();	

		ИДСтроки = ОбойтиУровеньДерева(КоллекцияЭлементовДерева, ТекущийУзел);

		Если ИДСтроки <> Неопределено Тогда
			Элементы.Товары.Развернуть(ИДСтроки);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)

	//ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	//
	//НоменклатураСервер.УстановитьКоличестоПоРазмещению(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.Количество);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)

	Если НЕ Элемент.ТекущиеДанные = Неопределено Тогда
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Номенклатура) Тогда
			ПоказатьКартинку(Элемент.ТекущиеДанные.Номенклатура);
		ИначеЕсли ЗначениеЗаполнено(Элемент.ТекущиеДанные.Размещение) Тогда
			Рез = ПоказатьКартинку(Элемент.ТекущиеДанные.Размещение);
			Если Рез = 0 Тогда
				ТекНоменклатура = ПолучитьРеквизитНоменклатура(Элемент.ТекущиеДанные.Размещение);
				ПоказатьКартинку(ТекНоменклатура);
			КонецЕсли;
		КонецЕсли; 	
	КонецЕсли; 	

КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;

	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Поле = Элементы.ТоварыРазмещение Тогда
		СтандартнаяОбработка = Ложь;
		Если ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
			ПоказатьЗначение(Неопределено, ТекущаяСтрока.Номенклатура);
		ИначеЕсли ЗначениеЗаполнено(ТекущаяСтрока.Размещение) Тогда
			ПоказатьЗначение(Неопределено, ТекущаяСтрока.Размещение);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	ИсходящийУзел = Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока).ПолучитьРодителя().Размещение;
	
	Элементы.Товары.ТекущаяСтрока = Строка;
	
	ЦелевойУзел = "";
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Размещение) Тогда
		ЦелевойУзел = Элемент.ТекущиеДанные.Размещение;
	ИначеЕсли ЗначениеЗаполнено(Элемент.ТекущиеДанные.Номенклатура) Тогда
		//ЦелевойУзел = НоменклатураСервер.ПолучитьРеквизитРазмещение(Элемент.ТекущиеДанные.Номенклатура);
		Сообщить("Целевой узел не определен");
		Возврат;
	Иначе
		Возврат;
	КонецЕсли;

	МассивНоменклатура	= Новый Массив;
	МассивРазмещения	= Новый Массив;
	Для каждого Т Из ПараметрыПеретаскивания.Значение Цикл
		Если ТипЗнч(Т) = Тип("Число") Тогда
			ТекНоменклатура	= Товары.НайтиПоИдентификатору(Т).Номенклатура;
			ТекРазмещение	= Товары.НайтиПоИдентификатору(Т).Размещение;
			Если ЗначениеЗаполнено(ТекНоменклатура) Тогда
				МассивНоменклатура.Добавить(ТекНоменклатура);
			ИначеЕсли ЗначениеЗаполнено(ТекРазмещение) Тогда
				МассивРазмещения.Добавить(ТекРазмещение);
			КонецЕсли;
		ИначеЕсли ТипЗнч(Т) = Тип("СправочникСсылка.Номенклатура") Тогда
			МассивНоменклатура.Добавить(Т);
		КонецЕсли;	
	КонецЦикла;
	
	Если МассивНоменклатура.Количество() > 0 Тогда
		УстановитьРазмещение(МассивНоменклатура, ЦелевойУзел, ИсходящийУзел);
	ИначеЕсли МассивРазмещения.Количество() > 0 Тогда
		УстановитьСтруктуруГрупп(МассивРазмещения, ЦелевойУзел);
	КонецЕсли;

	//ТекущийУзел = ЦелевойУзел;
	УстановитьИсториюУзлов(ЦелевойУзел);
	
	ЗаполнитьДеревоТовары();

	КоллекцияЭлементовДерева = Товары.ПолучитьЭлементы();	

	ИДСтроки = ОбойтиУровеньДерева(КоллекцияЭлементовДерева, ТекущийУзел);

	Если ИДСтроки <> Неопределено Тогда
		Элементы.Товары.Развернуть(ИДСтроки);
	КонецЕсли;

	НоменклатураКлиент.УстановитьВидимостьКорзины(Элементы);
	
	Парам = Новый Структура();
	Парам.Вставить("ЦелевойУзел", ЦелевойУзел);
	Если НоменклатураСервер.ЭтоГруппа(ЦелевойУзел) Тогда
		Оповестить("Запись_ГруппыРазмещения", Парам, ЭтотОбъект);
	Иначе
		Оповестить("Запись_ЭлементаРазмещения", Парам, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)

	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;

	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
		ПометитьНаУдаление(ТекущаяСтрока.Номенклатура);
	ИначеЕсли ЗначениеЗаполнено(ТекущаяСтрока.Размещение) Тогда
		ПометитьНаУдаление(ТекущаяСтрока.Размещение);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КорзинаНажатие(Элемент)
	
	НастройкаНачальнойСтраницыНаСервере();
	ОбновитьИнтерфейс();

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьТекущийУзел1(Элемент)

	ВремТекущийУзел = ТекущийУзел;
	ТекущийУзел = ТекущийУзел1;

	ЗаполнитьДеревоТовары();

	КоллекцияЭлементовДерева = Товары.ПолучитьЭлементы();	

	ИДСтроки = ОбойтиУровеньДерева(КоллекцияЭлементовДерева, ТекущийУзел);

	Если ИДСтроки <> Неопределено Тогда
		Элементы.Товары.Развернуть(ИДСтроки);
	КонецЕсли;

	ТекущийУзел = ВремТекущийУзел;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьТекущийУзел2(Элемент)

	ВремТекущийУзел = ТекущийУзел;
	ТекущийУзел = ТекущийУзел2;

	ЗаполнитьДеревоТовары();

	КоллекцияЭлементовДерева = Товары.ПолучитьЭлементы();	

	ИДСтроки = ОбойтиУровеньДерева(КоллекцияЭлементовДерева, ТекущийУзел);

	Если ИДСтроки <> Неопределено Тогда
		Элементы.Товары.Развернуть(ИДСтроки);
	КонецЕсли;

	ТекущийУзел = ВремТекущийУзел;

КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ОбновитьДеревоТоваров(Команда)

	ЗаполнитьДеревоТовары();

	КоллекцияЭлементовДерева = Товары.ПолучитьЭлементы();	

	ИДСтроки = ОбойтиУровеньДерева(КоллекцияЭлементовДерева, ТекущийУзел);

	Если ИДСтроки <> Неопределено Тогда
		Элементы.Товары.Развернуть(ИДСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРазмещениеГруппа(Команда)

	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Парам = Новый Структура();
	Парам.Вставить("ЭтоГруппа", Истина);
	Парам.Вставить("Родитель", ТекущаяСтрока.Размещение);
	
	ОткрытьФорму("Справочник.Размещения.ФормаГруппы", Парам);

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРазмещениеЭлемент(Команда)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Парам = Новый Структура();
	Парам.Вставить("Родитель", ТекущаяСтрока.Размещение);
	
	ОткрытьФорму("Справочник.Размещения.ФормаОбъекта", Парам);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекущийУзел(Команда)

	ТекДанные = Элементы.Товары.ТекущиеДанные;
	
	ЦелевойУзел = "";
	Если ЗначениеЗаполнено(ТекДанные.Размещение) Тогда
		ЦелевойУзел = ТекДанные.Размещение;
	//ИначеЕсли ЗначениеЗаполнено(ТекДанные.Номенклатура) Тогда
	//	ЦелевойУзел = НоменклатураСервер.ПолучитьРеквизитРазмещение(ТекДанные.Номенклатура);
	Иначе
		Возврат;
	КонецЕсли;
	
    УстановитьИсториюУзлов(ЦелевойУзел);

КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсе(Команда)

	СвернутьВсеДеревоРекурсивно(Товары.ПолучитьЭлементы());
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсе(Команда)

	Для каждого Ид Из Товары.ПолучитьЭлементы() Цикл
	    Элементы.Товары.Развернуть(Ид.ПолучитьИдентификатор(), Истина);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область Картинки

&НаСервереБезКонтекста
Функция НавигационнаяСсылкаКартинки(ФайлКартинки, ИдентификаторФормы)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		АдресКартинки = РаботаСФайлами.ДанныеФайла(ФайлКартинки, ИдентификаторФормы).СсылкаНаДвоичныеДанныеФайла;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		АдресКартинки = "";
	КонецПопытки;
	
	Возврат АдресКартинки;
	
КонецФункции

Функция ПоказатьКартинку(п_ВладелецФайла)

	Запрос = Новый Запрос;

	Если ТипЗнч(п_ВладелецФайла) = Тип("СправочникСсылка.Номенклатура") Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НоменклатураПрисоединенныеФайлы.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.НоменклатураПрисоединенныеФайлы КАК НоменклатураПрисоединенныеФайлы
			|ГДЕ
			|	НоменклатураПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
			|	И НЕ НоменклатураПрисоединенныеФайлы.ПометкаУдаления
			|
			|УПОРЯДОЧИТЬ ПО
			|	НоменклатураПрисоединенныеФайлы.ДатаСоздания";
		
	ИначеЕсли ТипЗнч(п_ВладелецФайла) = Тип("СправочникСсылка.Размещения") Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РазмещенияПрисоединенныеФайлы.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.РазмещенияПрисоединенныеФайлы КАК РазмещенияПрисоединенныеФайлы
			|ГДЕ
			|	РазмещенияПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
			|	И НЕ РазмещенияПрисоединенныеФайлы.ПометкаУдаления
			|
			|УПОРЯДОЧИТЬ ПО
			|	РазмещенияПрисоединенныеФайлы.ДатаСоздания";
	Иначе
		Возврат 0;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВладелецФайла", п_ВладелецФайла);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Количество() = 1 Тогда
		
		Элементы.СтраницыИзображения.ТекущаяСтраница = Элементы.СтраницаИзображения1;

		Если Выборка.Следующий() Тогда
			СсылкаНаКартинку = НавигационнаяСсылкаКартинки(Выборка.Ссылка, УникальныйИдентификатор);
		КонецЕсли;

	ИначеЕсли Выборка.Количество() = 2 Тогда
		Элементы.СтраницыИзображения.ТекущаяСтраница = Элементы.СтраницаИзображения2;
		Выборка.Следующий();
		СсылкаНаКартинку = НавигационнаяСсылкаКартинки(Выборка.Ссылка, УникальныйИдентификатор);
		Выборка.Следующий();
		СсылкаНаКартинку2 = НавигационнаяСсылкаКартинки(Выборка.Ссылка, УникальныйИдентификатор);
	ИначеЕсли Выборка.Количество() = 3 Тогда
		Элементы.СтраницыИзображения.ТекущаяСтраница = Элементы.СтраницаИзображения4;
		Выборка.Следующий();
		СсылкаНаКартинку = НавигационнаяСсылкаКартинки(Выборка.Ссылка, УникальныйИдентификатор);
		Выборка.Следующий();
		СсылкаНаКартинку2 = НавигационнаяСсылкаКартинки(Выборка.Ссылка, УникальныйИдентификатор);
		Выборка.Следующий();
		СсылкаНаКартинку3 = НавигационнаяСсылкаКартинки(Выборка.Ссылка, УникальныйИдентификатор);
	ИначеЕсли Выборка.Количество() >= 4 Тогда
		Элементы.СтраницыИзображения.ТекущаяСтраница = Элементы.СтраницаИзображения4;
		Выборка.Следующий();
		СсылкаНаКартинку = НавигационнаяСсылкаКартинки(Выборка.Ссылка, УникальныйИдентификатор);
		Выборка.Следующий();
		СсылкаНаКартинку2 = НавигационнаяСсылкаКартинки(Выборка.Ссылка, УникальныйИдентификатор);
		Выборка.Следующий();
		СсылкаНаКартинку3 = НавигационнаяСсылкаКартинки(Выборка.Ссылка, УникальныйИдентификатор);
		Выборка.Следующий();
		СсылкаНаКартинку4 = НавигационнаяСсылкаКартинки(Выборка.Ссылка, УникальныйИдентификатор);
	Иначе		
		Элементы.СтраницыИзображения.ТекущаяСтраница = Элементы.СтраницаИзображения1;
		СсылкаНаКартинку = "";
		СсылкаНаКартинку2 = "";
		СсылкаНаКартинку3 = "";
		СсылкаНаКартинку4 = "";
	КонецЕсли;
	
	Возврат Выборка.Количество();
	
КонецФункции

#КонецОбласти

#Область РаботаСДеревом

Процедура УстановитьСтруктуруГрупп(п_МассивРазмещения, п_ЦелевойУзел)
	
	Для каждого Т Из п_МассивРазмещения Цикл
		Об = Т.ПолучитьОбъект();
		Об.Родитель = п_ЦелевойУзел;
		Попытка
			Об.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

Процедура УстановитьРазмещение(п_МассивНоменклатура, п_ЦелевойУзел, п_ИсходящийУзел)
	
	Для каждого Т Из п_МассивНоменклатура Цикл
		
		Если п_ЦелевойУзел.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;

		НоменклатураСервер.ИзменитьРазмещение(Т, п_ЦелевойУзел, п_ИсходящийУзел);
		НоменклатураСервер.УстановитьВариантРазмещения(Т);
		
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьРеквизитНоменклатура(п_Размещение)
	
	Возврат п_Размещение.Номенклатура;

КонецФункции // ()

Процедура ПостроитьДеревоРекурсивно(ВыборкаСИерархией, Дерево)
	
	Пока ВыборкаСИерархией.Следующий() Цикл
		
		Если ВыборкаСИерархией.ТипЗаписи() = ТипЗаписиЗапроса.ИтогПоИерархии Тогда

			Строка = Дерево.Строки.Добавить();
			
			Строка.Размещение				= ВыборкаСИерархией.Размещение;
			Строка.РазмещениеВыделитьЦветом	= ВыборкаСИерархией.РазмещениеВыделитьЦветом;
			Строка.КореньВетки				= Истина;

			ПостроитьДеревоРекурсивно(ВыборкаСИерархией.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией, "Размещение"), Строка);

		ИначеЕсли ВыборкаСИерархией.ТипЗаписи() = ТипЗаписиЗапроса.ИтогПоГруппировке Тогда
			
			Строка1 = Дерево.Строки.Добавить();
			Строка1.Размещение					= ВыборкаСИерархией.Размещение;
			Строка1.РазмещениеВыделитьЦветом	= ВыборкаСИерархией.РазмещениеВыделитьЦветом;
			Строка1.КореньВетки					= Истина;

			Выборка = ВыборкаСИерархией.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока Выборка.Следующий() Цикл
			    Строка2 = Строка1.Строки.Добавить();
			    Строка2.Номенклатура		= Выборка.Номенклатура;
			    Строка2.ВыделитьЦветом		= Выборка.ВыделитьЦветом;
			    Строка2.Количество			= Выборка.Количество;
			    Строка2.Цена				= Выборка.Цена;
			    Строка2.ЦенаПриобретения	= Выборка.ЦенаПриобретения;
			КонецЦикла;
			
		КонецЕсли;   

	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьДеревоТовары()

	ДеревоРек = РеквизитФормыВЗначение("Товары");
	ДеревоРек.Строки.Очистить();

	Элементы.Товары.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВерхнийУровень;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ЦеныНоменклатурыСрезПоследних.ВидЦены.Наименование = ""На дату""
		|				ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
		|		КОНЕЦ) КАК ЦенаНаДату,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ЦеныНоменклатурыСрезПоследних.ВидЦены.Наименование = ""Приобретение""
		|				ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
		|		КОНЕЦ) КАК ЦенаПриобретения,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ЦеныНоменклатурыСрезПоследних.ВидЦены.Наименование = ""Приобретение""
		|				ТОГДА ЦеныНоменклатурыСрезПоследних.Период
		|		КОНЕЦ) КАК ДатаПриобретения
		|ПОМЕСТИТЬ ВТ_Цены
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛОЖЬ КАК КореньВетки,
		|	Размещения.Ссылка КАК Размещение,
		|	Размещения.ВыделитьЦветом КАК РазмещениеВыделитьЦветом,
		|	ОстаткиПоРазмещению.Номенклатура КАК Номенклатура,
		|	ОстаткиПоРазмещению.Количество КАК Количество,
		|	ОстаткиПоРазмещению.Номенклатура.ВыделитьЦветом КАК ВыделитьЦветом,
		|	ВТ_Цены.ЦенаНаДату КАК Цена,
		|	ВТ_Цены.ЦенаПриобретения КАК ЦенаПриобретения,
		|	ВТ_Цены.ДатаПриобретения КАК ДатаПриобретения
		|ИЗ
		|	Справочник.Размещения КАК Размещения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОстаткиПоРазмещению КАК ОстаткиПоРазмещению
		|		ПО Размещения.Ссылка = ОстаткиПоРазмещению.Размещение
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ВТ_Цены
		|		ПО (ОстаткиПоРазмещению.Номенклатура = ВТ_Цены.Номенклатура)
		|ГДЕ
		|	НЕ Размещения.ЭтоГруппа
		|	И НЕ Размещения.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Размещение,
		|	Номенклатура
		|ИТОГИ ПО
		|	Размещение ИЕРАРХИЯ
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСИерархией = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией, "Размещение");
	
	ПостроитьДеревоРекурсивно(ВыборкаСИерархией, ДеревоРек);
	
	ЗначениеВРеквизитФормы(ДеревоРек, "Товары");

КонецПроцедуры

&НаКлиенте
Функция ОбойтиУровеньДерева(п_ЭлементыДерева, п_ТекущийУзел)
	
    Для Каждого СтрокаДерева Из п_ЭлементыДерева Цикл 
		
    	ПодСтроки = СтрокаДерева.ПолучитьЭлементы();
		Если ПодСтроки.Количество() > 0 Тогда
			
			Если  СтрокаДерева.Размещение = п_ТекущийУзел Тогда
				ИдентификаторСтроки = СтрокаДерева.ПолучитьИдентификатор();
				Элементы.Товары.ТекущаяСтрока = ИдентификаторСтроки;
				Возврат ИдентификаторСтроки;
			КонецЕсли;
			
			Рез = ОбойтиУровеньДерева(ПодСтроки, п_ТекущийУзел);
			Если Рез <> Неопределено Тогда
				Возврат Рез;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецФункции // ()

&НаКлиенте
Процедура СвернутьВсеДеревоРекурсивно(п_КоллекцияЭлементов)

	Для каждого ЭлементКоллекции Из п_КоллекцияЭлементов Цикл

		ВложенныеЭлементыКоллекции = ЭлементКоллекции.ПолучитьЭлементы();
		
		Если (ВложенныеЭлементыКоллекции.Количество() > 0) Тогда
            СвернутьВсеДеревоРекурсивно(ВложенныеЭлементыКоллекции);
        Иначе
            Прервать;
        КонецЕсли;
        
        Элементы.Товары.Свернуть(ЭлементКоллекции.ПолучитьИдентификатор());
		
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ЭкспортныеПроцедурыФункции
	
&НаКлиенте
Функция ПолучитьТекущуюСтроку() Экспорт

	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;

	Возврат ТекущаяСтрока;

КонецФункции // ()

&НаКлиенте
Функция ПолучитьРодителяЭлементаДерева() Экспорт

	ТекущаяСтрока = Элементы.Товары.ТекущаяСтрока;
	
	ТекРодитель = Товары.НайтиПоИдентификатору(ТекущаяСтрока).ПолучитьРодителя();

	Возврат (ТекРодитель);

КонецФункции // ()

Процедура УстановитьМассивУзловРазмещения(УзлыРазмещения) Экспорт
	МассивУзловРазмещения.ЗагрузитьЗначения(УзлыРазмещения);
КонецПроцедуры

#КонецОбласти

#Область Прочее

Процедура УстановитьВидимостьИсторииУзлов()
	
	Если ЗначениеЗаполнено(ТекущийУзел) Тогда
		Элементы.ТекущийУзел.Видимость = Истина;
		Элементы.ТекущийУзел.Заголовок = ТекущийУзел;
	Иначе
		Элементы.ТекущийУзел.Видимость = Ложь;
	КонецЕсли;

	Если ЗначениеЗаполнено(ТекущийУзел1) Тогда
		Элементы.ТекущийУзел1.Видимость = Истина;
		Элементы.ТекущийУзел1.Заголовок = ТекущийУзел1;
	Иначе
		Элементы.ТекущийУзел1.Видимость = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущийУзел2) Тогда
		Элементы.ТекущийУзел2.Видимость = Истина;
		Элементы.ТекущийУзел2.Заголовок = ТекущийУзел2;
	Иначе
		Элементы.ТекущийУзел2.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьИсториюУзлов(Знач п_Узел)

	НоменклатураКлиент.УстановитьИсториюУзлов(ЭтаФорма, п_Узел);	
	
	УстановитьВидимостьИсторииУзлов();

КонецПроцедуры

Процедура ПометитьНаУдаление(п_Размещение)

	Об = п_Размещение.ПолучитьОбъект();
	Об.УстановитьПометкуУдаления(Истина, Истина);

КонецПроцедуры

Процедура НастройкаНачальнойСтраницыНаСервере()

	НастройкиНачальнойСтраницы = Новый НастройкиНачальнойСтраницы; 
	СоставФормНачальнойСтраницы = Новый СоставФормНачальнойСтраницы;

	СоставФормНачальнойСтраницы.ЛеваяКолонка.Добавить("Справочник.Номенклатура.Форма.Корзина");
	СоставФормНачальнойСтраницы.ПраваяКолонка.Добавить("Справочник.Номенклатура.Форма.ПоРазмещению");
	НастройкиНачальнойСтраницы.УстановитьСоставФорм(СоставФормНачальнойСтраницы);        
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы",, НастройкиНачальнойСтраницы);

КонецПроцедуры

&НаКлиенте
Процедура НастроитьФормуПриОткрытии()

	КоллекцияЭлементовДерева = Товары.ПолучитьЭлементы();	
	
	СвернутьВсеДеревоРекурсивно(КоллекцияЭлементовДерева);
	
	Если МассивУзловРазмещения.Количество() > 1 Тогда
		Для каждого УзелРазмещения Из МассивУзловРазмещения Цикл
			ИДСтроки = ОбойтиУровеньДерева(КоллекцияЭлементовДерева, УзелРазмещения.Значение);
			Если ИДСтроки <> Неопределено Тогда
				Элементы.Товары.Развернуть(ИДСтроки);
			КонецЕсли;
		КонецЦикла;
	Иначе		
		ИДСтроки = ОбойтиУровеньДерева(КоллекцияЭлементовДерева, ТекущийУзел);
		Если ИДСтроки <> Неопределено Тогда
			Элементы.Товары.Развернуть(ИДСтроки);
		КонецЕсли;
	КонецЕсли;
	
    НоменклатураКлиент.УстановитьВидимостьКорзины(Элементы);
	УстановитьВидимостьИсторииУзлов();

КонецПроцедуры

#КонецОбласти
